[
  {
    "source": {
      "id": "bbc-news",
      "name": "BBC News"
    },
    "author": null,
    "title": "IMF: US growth forecast to be hit from tariffs",
    "description": "The US is forecast to be hit the hardest among advanced economies because of uncertainty caused by tariffs, the IMF says. Growth is now expected to be 1.8% this year, down from the IMF's estimate of 2.7% for the US in January. It comes after US stocks and the…",
    "url": "https://www.bbc.co.uk/programmes/w172zss0x7cv7r0",
    "urlToImage": "https://ichef.bbci.co.uk/images/ic/1200x675/p0l5s8z5.jpg",
    "publishedAt": "2025-04-22T14:13:00Z",
    "content": "The US is forecast to be hit the hardest among advanced economies because of uncertainty caused by tariffs, the IMF says. Growth is now expected to be 1.8% this year, down from the IMF's estimate of … [+669 chars]"
  },
  {
    "source": {
      "id": "bbc-news",
      "name": "BBC News"
    },
    "author": null,
    "title": "Trump attacks Fed boss for not cutting interest rates",
    "description": "President Trump has attacked the head of the US Central Bank Jerome Powell for refusing to cut interest rates, saying he should be terminated from his position. We speak to economists for and against sacking the president's latest critic. \n\nAlso on the progra…",
    "url": "https://www.bbc.co.uk/programmes/w172zss0jz28r58",
    "urlToImage": "https://ichef.bbci.co.uk/images/ic/1200x675/p0l52d2f.jpg",
    "publishedAt": "2025-04-17T21:06:00Z",
    "content": "President Trump has attacked the head of the US Central Bank Jerome Powell for refusing to cut interest rates, saying he should be terminated from his position. We speak to economists for and against… [+551 chars]"
  },
  {
    "source": {
      "id": "bbc-news",
      "name": "BBC News"
    },
    "author": "Annabelle Liang",
    "title": "Trump Tariffs: Gold hits fresh record high over trade war fears",
    "description": "It comes after the head of US central bank said Trump's tariff policies are likely to mean slower growth and higher prices.",
    "url": "https://www.bbc.co.uk/news/articles/cdrg6mnr8vpo",
    "urlToImage": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f37/live/b5bc7760-1b26-11f0-8a4d-f31c1720b539.jpg",
    "publishedAt": "2025-04-17T03:45:14Z",
    "content": "In remarks for the Economic Club of Chicago on Wednesday, Federal Reserve Chair Jerome Powell said the higher-than-expected tariffs announced in recent weeks are likely to mean US economic growth wil… [+1840 chars]"
  },
  {
    "source": {
      "id": "bbc-news",
      "name": "BBC News"
    },
    "author": "Michael Race",
    "title": "Tariffs will hit US economy and raise prices - Federal Reserve Chair Jerome Powell",
    "description": "Jerome Powell, chair of the Federal Reserve, said Donald Trump's new import taxes were larger than expected.",
    "url": "https://www.bbc.co.uk/news/articles/c77ndzy0m2vo",
    "urlToImage": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22b4/live/b278ff40-1af1-11f0-8afe-6b280db06f6c.jpg",
    "publishedAt": "2025-04-16T19:25:46Z",
    "content": "All three main US stock markets suffered sharp falls on Wednesday. The Dow Jones fell 1.73%, while the S&amp;P 500 and Nasdaq ended the day down 2.24% and 3.07% respectively. \r\nBut perhaps more conce… [+1980 chars]"
  }
]