[
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Bryan O'Shea",
    "title": "ECB flags risk of financial contagion from US Crypto push",
    "description": "The European Central Bank (ECB) has raised alarm over the potential fallout from the United States’ aggressive support for the crypto industry, warning that a surge in dollar-backed stablecoins could destabilize Europe’s financial system.According to a policy…",
    "url": "https://cointelegraph.com/news/ecb-warns-us-crypto-push-stablecoin-risk-europe",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/01965caa-b152-78c7-8212-6e46938e36d7",
    "publishedAt": "2025-04-22T09:51:53Z",
    "content": "The European Central Bank (ECB) raised an alarm over potential fallout from aggressive US support for the crypto industry, warning that a surge in dollar-backed stablecoins could destabilize Europes … [+2722 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Oluwapelumi Adejumo",
    "title": "Paul Atkins takes over as SEC chair today aiming to usher in new pro-crypto era",
    "description": "Paul Atkins officially took office as the 34th US Securities and Exchange Commission (SEC) chairman on April 21. This marks a return to the agency for Atkins, who previously served as an SEC Commissioner from 2002 to 2008 during the George W. Bush administrat…",
    "url": "https://cryptoslate.com/paul-atkins-takes-over-as-sec-chair-today-aiming-to-usher-in-new-pro-crypto-era/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/04/paul-atkins-sec_.jpg",
    "publishedAt": "2025-04-22T09:45:36Z",
    "content": "Paul Atkins officially took office as the 34th US Securities and Exchange Commission (SEC) chairman on April 21.\r\nThis marks a return to the agency for Atkins, who previously served as an SEC Commiss… [+2668 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yugatech.com"
    },
    "author": "YugaTech Brand Partner",
    "title": "How AI and Live Streaming Are Changing Online Roulette in the Philippines",
    "description": "The Digital Shift in Philippine Gambling The gambling industry in the Philippines has undergone a major transformation, with more players shifting from traditional land-based casinos to online platforms. This change is driven by technological advancements, ne…",
    "url": "https://www.yugatech.com/news/how-ai-and-live-streaming-are-changing-online-roulette-in-the-philippines/",
    "urlToImage": "https://www.yugatech.com/wp-content/uploads/2025/04/AI-and-Live-Streaming.png",
    "publishedAt": "2025-04-22T07:49:40Z",
    "content": "The Digital Shift in Philippine Gambling\r\nThe gambling industry in the Philippines has undergone a major transformation, with more players shifting from traditional land-based casinos to online platf… [+6462 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Martin Young",
    "title": "KuCoin’s settlement with CFTC in flux after Trump policy shift",
    "description": "A planned settlement between the US Commodity Futures Trading Commission and crypto exchange KuCoin will likely be delayed after a policy shift at the CFTC to deprioritize cases against crypto companies under the Trump administration. CFTC attorney John Murph…",
    "url": "https://cointelegraph.com/news/kucoin-case-in-limbo-after-cftc-crypto-policy-pivot",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2024-11/0193532f-1e10-7d74-914e-fc7fa7b48711",
    "publishedAt": "2025-04-22T05:45:05Z",
    "content": "A planned settlement between the US Commodity Futures Trading Commission and crypto exchange KuCoin will likely be delayed after a policy shift at the CFTC to deprioritize cases against crypto compan… [+2643 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "Marvie Basilan",
    "title": "New SEC Chair Paul Atkins Under Pressure With 72 Crypto-Related ETF Applications, $XRP Leads Filings",
    "description": "Paul Atkins is now the official SEC Chair, entering the Wall Street regulator with much expectations and picking up the pieces of the broken relationship that his predecessor left behind with the crypto industry.",
    "url": "https://www.ibtimes.com/new-sec-chair-paul-atkins-under-pressure-72-crypto-related-etf-applications-xrp-leads-filings-3770850",
    "urlToImage": "https://d.ibtimes.com/en/full/4595506/paul-atkins.jpg",
    "publishedAt": "2025-04-22T05:24:22Z",
    "content": "KEY POINTS\r\n<ul><li>Among Atkins's responsibilities is decision-making on 72 crypto-related ETFs</li><li>$XRP has the most filings so far, but $SOL applications are also piling up</li><li>Atkins is k… [+3990 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Crypto Briefing"
    },
    "author": "Vivian Nguyen",
    "title": "Trump expected to attend SEC Chair Atkins’ swearing-in ceremony at White House today",
    "description": "Atkins' leadership may reshape SEC's approach to digital assets, potentially accelerating crypto regulations and ETF approvals.\nThe post Trump expected to attend SEC Chair Atkins’ swearing-in ceremony at White House today appeared first on Crypto Briefing.",
    "url": "https://cryptobriefing.com/sec-leadership-transition-ceremony/",
    "urlToImage": "https://static.cryptobriefing.com/wp-content/uploads/2025/04/22003748/0fb9bed8-2bdc-40c4-951a-ee79fed09edd-800x420.jpg",
    "publishedAt": "2025-04-22T04:42:12Z",
    "content": "Key Takeaways\r\n<ul><li>President Trump will attend Paul Atkins' swearing-in as SEC Chair at the White House.</li><li>Paul Atkins prioritizes digital assets regulation, including pending resolutions o… [+1851 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Rubmar Garcia",
    "title": "Banking Giants Deutsche Bank, Standard Chartered Exploring Crypto Operations Expansion In The US – Report",
    "description": "Recent reports claim that crypto firms and financial giants are looking into expanding their operations in the US market following the Trump administration’s efforts to regulate the digital assets industry and incorporate it into mainstream finance. Related R…",
    "url": "https://bitcoinist.com/banking-giants-deutsche-bank-standard-chartered-exploring-crypto-operations-expansion-in-the-us-report/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2024/08/ben-white-9cvYePOAyKc-unsplash-1.jpg",
    "publishedAt": "2025-04-22T03:30:30Z",
    "content": "Recent reports claim that crypto firms and financial giants are looking into expanding their operations in the US market following the Trump administrations efforts to regulate the digital assets ind… [+3287 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Decrypt"
    },
    "author": "Vince Dioquino",
    "title": "Paul Atkins Returns to SEC Helm as Trump Reasserts Influence Over Agency Watchdog",
    "description": "Former SEC Commissioner Atkins returns to shape a \"rational\" crypto framework, with a $327M net worth, he's the richest SEC chair in decades.",
    "url": "https://decrypt.co/315705/paul-atkins-returns-sec-helm",
    "urlToImage": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2025/04/paul-atkins-sec-1-gID_7.jpg",
    "publishedAt": "2025-04-22T03:14:57Z",
    "content": "In brief\r\n<ul><li>Atkins was sworn in as SEC chair after a 52-44 Senate vote earlier this month confirmed his seat.</li><li>The new chairman owns up to $6M in crypto and helped develop digital asset … [+3025 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Zarah Hamid",
    "title": "Robinhood Markets, Inc. (HOOD): Among Stocks That Could 10X Over the Next 2 Years",
    "description": "We recently published a list of 9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where Robinhood Markets, Inc. ...",
    "url": "https://finance.yahoo.com/news/robinhood-markets-inc-hood-among-023956536.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yoVdKNwBOZEOZs2_YPEELg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/ec7cdbcb5520f1c412e1549972f60dcf",
    "publishedAt": "2025-04-22T02:39:56Z",
    "content": "We recently published a list of 9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where Robinhood Markets, Inc. (NASDAQ:HOOD) stands against other stocks … [+4535 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Erickimphotography.com"
    },
    "author": "ERIC KIM",
    "title": "How to Use Bitcoin to Tokenize Real Estate",
    "description": "Key Points Research suggests Bitcoin can tokenize real estate, but it’s complex and typically done through its fork, Bitcoin SV (BSV), due to the original Bitcoin’s limitations. It seems likely that platforms like Tokenized on BSV enable creating tokens for r…",
    "url": "https://erickimphotography.com/blog/2025/04/21/how-to-use-bitcoin-to-tokenize-real-estate/",
    "urlToImage": null,
    "publishedAt": "2025-04-22T01:57:40Z",
    "content": "Key Points\r\n<ul><li>Research suggests Bitcoin can tokenize real estate, but its complex and typically done through its fork, Bitcoin SV (BSV), due to the original Bitcoins limitations.</li><li>It see… [+11086 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Brayden Lindrea",
    "title": "Paul Atkins’ loosely linked RSR token rises 13% after Coinbase listing",
    "description": "A governance token for the Reserve Protocol stablecoin, launched by a firm previously advised by sworn-in SEC Chair Paul Atkins, has surged over 13% after crypto exchange Coinbase announced that it will list the token. Atkins was an early adviser for the stab…",
    "url": "https://cointelegraph.com/news/rsr-token-linked-sec-paul-atkins-rises-double-digits",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/01965a66-3fc4-7744-b96b-9eb9ceb9b372",
    "publishedAt": "2025-04-22T01:53:41Z",
    "content": "A governance token for the Reserve Protocol stablecoin, launched by a firm previously advised by sworn-in SEC Chair Paul Atkins, has surged over 13% after crypto exchange Coinbase announced that it w… [+1966 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Gino Matos",
    "title": "SEC reviewing 72 crypto-related ETF applications, including derivatives as of April 21",
    "description": "The US Securities and Exchange Commission (SEC) is currently reviewing 72 crypto-related exchange-traded fund (ETF) filings, according to data shared by Bloomberg senior ETF analyst Eric Balchunas on April 21. The filings cover assets ranging from XRP, Liteco…",
    "url": "https://cryptoslate.com/sec-reviewing-72-crypto-related-etf-applications-including-derivatives-as-of-april-21/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/04/ussec-bitcoin.jpg",
    "publishedAt": "2025-04-21T17:36:01Z",
    "content": "The US Securities and Exchange Commission (SEC) is currently reviewing 72 crypto-related exchange-traded fund (ETF) filings, according todata shared by Bloomberg senior ETF analyst Eric Balchunas on … [+3070 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CoinDesk"
    },
    "author": "Tuongvy Le",
    "title": "5 Ways the SEC Can Embrace Innovation",
    "description": "Tuongvy Le, a former senior SEC attorney, lays out an agenda for the world’s most important regulator to stay ahead of the competition. One approach: adopting blockchain tech.",
    "url": "https://www.coindesk.com/opinion/2025/04/21/5-ways-the-sec-can-embrace-innovation",
    "urlToImage": "https://cdn.sanity.io/images/s3y3vcno/production/d515099cc27d1cef5d333e5c01bb778ce49d7531-6000x3376.jpg?auto=format",
    "publishedAt": "2025-04-21T15:27:05Z",
    "content": "The U.S. Securities and Exchange Commission has long been the worlds most influential financial regulator, helping to ensure our capital markets are the deepest, fairest, and most accessible in the w… [+5960 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Dilip Kumar Patairya",
    "title": "Gold-backed vs USD-backed stablecoins: Key differences",
    "description": "What are gold-backed stablecoins, and how do they work? \r\nGold-backed stablecoins are digital currencies pegged to physical gold reserves and designed to maintain a stable value. The concept of gold-backed digital currencies dates back to the early days of cr…",
    "url": "https://cointelegraph.com/explained/gold-backed-vs-usd-backed-stablecoins-key-differences",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/storage/uploads/view/6259d082e83d20491f43075c38d970ea.png",
    "publishedAt": "2025-04-21T13:15:00Z",
    "content": "What are gold-backed stablecoins, and how do they work? \r\nGold-backed stablecoins are digital currencies pegged to physical gold reserves and designed to maintain a stable value. The concept of gold-… [+11908 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Adrian Zmudzinski",
    "title": "Circle, BitGo about to apply for bank charter, others may follow: WSJ",
    "description": "Major cryptocurrency firms, including stablecoin issuer Circle and crypto custodian BitGo, are reportedly considering applying for bank charters or licenses.According to an April 21 Wall Street Journal report citing people familiar with the matter, Circle, Bi…",
    "url": "https://cointelegraph.com/news/circle-bit-go-about-to-apply-for-bank-charter-others-may-follow",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/019657ec-d6e2-7871-9016-1ec8da5e9e4d",
    "publishedAt": "2025-04-21T12:55:49Z",
    "content": "Major cryptocurrency firms, including stablecoin issuer Circle and crypto custodian BitGo, are reportedly considering applying for bank charters or licenses.\r\nAccording to an April 21 Wall Street Jou… [+3479 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Project Syndicate"
    },
    "author": "Joseph E. Stiglitz",
    "title": "America Is Becoming the World’s Largest Tax Haven",
    "description": "In a world where capital and rich individuals can cross borders freely, only international cooperation can ensure that multinational corporations and the superrich are fairly taxed. That's why US President Donald Trump rejects it, and also why his administrat…",
    "url": "https://www.project-syndicate.org/commentary/america-becoming-largest-tax-haven-under-trump-by-joseph-e-stiglitz-2025-04",
    "urlToImage": "https://webapi.project-syndicate.org/library/fe804c528638c5d7aab4b43b8ffb74a6.2-1-super.1.jpg",
    "publishedAt": "2025-04-21T12:21:50Z",
    "content": "In a world where capital and rich individuals can cross borders freely, only international cooperation can ensure that multinational corporations and the superrich are fairly taxed. That's why US Pre… [+7833 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "The Daily Hodl"
    },
    "author": "Alex Richardson",
    "title": "Bank for International Settlements Says Real-World Assets To Drive Link Between Crypto and TradFi",
    "description": "The Bank for International Settlements (BIS) says that the tokenization of real-world assets (RWAs) on blockchains will develop stronger links between crypto and traditional finance (TradFi). In a new paper on the financial stability risks of crypto, BIS anal…",
    "url": "https://dailyhodl.com/2025/04/21/bank-for-international-settlements-says-real-world-assets-to-drive-link-between-crypto-and-tradfi/",
    "urlToImage": "https://dailyhodl.com/wp-content/uploads/2024/03/Three-Crypto-Plays.jpg",
    "publishedAt": "2025-04-21T11:45:05Z",
    "content": "The Bank for International Settlements (BIS) says that the tokenization of real-world assets (RWAs) on blockchains will develop stronger links between crypto and traditional finance (TradFi).\r\nIn a n… [+2327 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "TradFi Turns To Crypto: Top Brokerage Firm Plots 2026 Trading Debut",
    "description": "Charles Schwab, a top brokerage firm in the United States, has laid plans to roll out a cryptocurrency trading platform as early as next year. The development marks increasing mainstream adoption of digital currencies and may redefine the competitive dynamics…",
    "url": "https://bitcoinist.com/tradfi-turns-crypto-top-brokerage-firm-plots-2026-trading-debut/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/a_4fe9ae.jpg",
    "publishedAt": "2025-04-21T11:30:19Z",
    "content": "Charles Schwab, a top brokerage firm in the United States, has laid plans to roll out a cryptocurrency trading platform as early as next year. The development marks increasing mainstream adoption of … [+2876 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "The Intercept"
    },
    "author": "Matt Sledge",
    "title": "Congress’s Biggest Financial Priority Is “Stablecoin.” What the Hell Is That?",
    "description": "Instead of tackling crashing markets, Congress is pushing a crypto sector that the Trump family is financially involved in.\nThe post Congress’s Biggest Financial Priority Is “Stablecoin.” What the Hell Is That? appeared first on The Intercept.",
    "url": "https://theintercept.com/2025/04/21/congress-crypto-stablecoin-trump/",
    "urlToImage": "https://theintercept.com/wp-content/uploads/2025/04/AP25084668780449-e1745009848787.jpg?fit=6336%2C3168&w=1200&h=800",
    "publishedAt": "2025-04-21T10:00:00Z",
    "content": "The Trump administrations trade war with the world has roiled the stock market and threatens to plunge the country into a recession while jacking up the price of basic supplies.\r\nBut instead of takin… [+9344 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "David Wright",
    "title": "Donald Trump raised nearly $240 million for his inauguration — more than double the previous record, new filings show",
    "description": "President Donald Trump’s inaugural committee collected a staggering $239 million for the festivities surrounding his swearing-in this year — with some of the nation’s wealthiest people and biggest companies writing large checks as they sought to ingratiate th…",
    "url": "https://www.cnn.com/2025/04/20/politics/trump-inaugural-committee-fundraising-total/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25020742190089.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2025-04-21T02:22:10Z",
    "content": "President Donald Trumps inaugural committee collected a staggering $239 millionfor the festivities surrounding his swearing-in this year with some of the nations wealthiest people and biggest compani… [+6021 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "'I was careful and followed instructions closely, but still lost my crypto'",
    "description": "A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply.",
    "url": "https://www.bbc.com/news/articles/c93gydxj8n7o",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/5c41/live/4e282740-1c6e-11f0-8a1e-3ff815141b98.jpg",
    "publishedAt": "2025-04-21T01:04:27Z",
    "content": "Tzoni Raykov says Revolut's deposit instructions are not clear enough\r\nTrading cryptocurrency was just a bit of fun for Tzoni Raykov, but losing $1,500 worth to an administrative error has left him w… [+7981 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "Crypto Exec Blasts BIS: ‘Fear, Arrogance, Or Ignorance—Their Views Are Dangerous’",
    "description": "A major clash has erupted between cryptocurrency industry leaders and banking regulators over how to handle the growing crypto market. CoinFund president Christopher Perkins has called the Bank for International Settlements’ (BIS) recent recommendations on cr…",
    "url": "https://bitcoinist.com/crypto-exec-blasts-bis-fear-arrogance-or-ignorance-their-views-are-dangerous/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/a_6ddadb.png",
    "publishedAt": "2025-04-20T16:00:51Z",
    "content": "A major clash has erupted between cryptocurrency industry leaders and banking regulators over how to handle the growing crypto market.\r\nCoinFund president Christopher Perkins has called the Bank for … [+3060 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Nizan Geslevich Packin, Contributor, \n Nizan Geslevich Packin, Contributor\n https://www.forbes.com/sites/nizangpackin/",
    "title": "AI Agents As Customers: Rethinking The Marketplace Of The Future",
    "description": "AI agents, powered by MCP, are becoming customers reshaping consumer finance. They promise speed but risk automation bias & paywalling humans, requiring fair oversight.",
    "url": "https://www.forbes.com/sites/nizangpackin/2025/04/20/ai-agents-as-customers-rethinking-the-marketplace-of-the-future/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6804b5f0376d309979fecdb2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-04-20T09:20:30Z",
    "content": "When Your Mortgage Broker Is a Bot\r\nIts 9:03 a.m. Your phone vibrates. Good news, a cheery voice chirps. I renegotiated your mortgage down 43 basis points and locked the rate. Shall I move the saved … [+7436 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Semilore Faleti",
    "title": "SafeMoon CEO Set To Face Trial Despite DOJ Crypto Memo",
    "description": "New York prosecutors have stated intentions to proceed with the trial of SafeMoon CEO Braden John Karony, despite a recent directive by the US Department of Justice (DOJ) to scale back certain types of crypto enforcement actions. This development adds another…",
    "url": "https://bitcoinist.com/safemoon-ceo-set-to-face-trial-doj-crypto-memo/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/EyOTZlYWYAQF7zS.jpg",
    "publishedAt": "2025-04-20T08:30:21Z",
    "content": "New York prosecutors have stated intentions to proceed with the trial of SafeMoon CEO Braden John Karony, despite a recent directive by the US Department of Justice (DOJ) to scale back certain types … [+2817 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Vince Quill",
    "title": "Crypto industry is not experiencing regulatory capture — Attorney",
    "description": "Brandon Ferrick, general counsel at Douro Labs, said that the Securities and Exchange Commission's (SEC) openness to public input on crypto policy and their roundtable discussions are positive signs that the crypto industry is not currently experiencing regul…",
    "url": "https://cointelegraph.com/news/crypto-industry-notexperiencing-regulatory-capture",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-03/0195ed4c-a85a-73b9-baea-2ad9282dfe6d",
    "publishedAt": "2025-04-19T17:39:37Z",
    "content": "Brandon Ferrick, general counsel at Douro Labs, said that the Securities and Exchange Commission's (SEC) openness to public input on crypto policy and their roundtable discussions are positive signs … [+2408 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Rubmar Garcia",
    "title": "Oregon To ‘Resurrect’ SEC’s Crypto Regulation By Enforcement With ‘Copycat’ Lawsuit Against Coinbase",
    "description": "Crypto exchange Coinbase revealed that Oregon’s Attorney General plans to file a lawsuit similar to the Securities and Exchange Commission (SEC)’s dismissed case. According to the exchange, Oregon is reportedly trying to revive the US regulator’s long-critici…",
    "url": "https://bitcoinist.com/oregon-to-resurrect-secs-crypto-regulation-by-enforcement-with-copycat-lawsuit-against-coinbase/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2024/01/tingey-injury-law-firm-6sl88x150Xs-unsplash.jpg",
    "publishedAt": "2025-04-19T15:00:39Z",
    "content": "Crypto exchange Coinbase revealed that Oregons Attorney General plans to file a lawsuit similar to the Securities and Exchange Commission (SEC)s dismissed case. According to the exchange, Oregon is r… [+3592 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "coindesk.com",
    "title": "Unpacking the DOJ's Crypto Enforcement Memo",
    "description": "Earlier this month, the Department of Justice disbanded its National Cryptocurrency Enforcement Team and said it would no longer pursue what Deputy Attorney General Todd Blanche described as \"regulation by prosecution.\"\nYou’re reading State of Crypto, a CoinD…",
    "url": "https://biztoc.com/x/6d8a5281608a8438",
    "urlToImage": "https://biztoc.com/cdn/6d8a5281608a8438_s.webp",
    "publishedAt": "2025-04-19T14:35:25Z",
    "content": "Earlier this month, the Department of Justice disbanded its National Cryptocurrency Enforcement Team and said it would no longer pursue what Deputy Attorney General Todd Blanche described as \"regulat… [+145 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "PR Newswire UK"
    },
    "author": null,
    "title": "Bybit's CEO Meets with Vietnam's Minister of Finance to Support Regulatory Sandbox and Strengthen Crypto Compliance",
    "description": "DUBAI, UAE, April 19, 2025 /PRNewswire/ -- Ben Zhou, Co-founder and CEO of Bybit, one of the world's second-largest cryptocurrency exchanges by trading volume, met with H.E. Nguyen Van Thang, Minister of Finance of Vietnam, to express Bybit's strong support f…",
    "url": "https://www.prnewswire.co.uk/news-releases/bybits-ceo-meets-with-vietnams-minister-of-finance-to-support-regulatory-sandbox-and-strengthen-crypto-compliance-302432942.html",
    "urlToImage": "https://mma.prnewswire.com/media/2668605/From_left_Ben_Zhou_Co_founder_CEO_Bybit_H_E_Nguyen.jpg?p=facebook",
    "publishedAt": "2025-04-19T14:17:00Z",
    "content": "DUBAI, UAE, April 19, 2025 /PRNewswire/ -- Ben Zhou, Co-founder and CEO of Bybit\r\n, one of the world's second-largest cryptocurrency exchanges by trading volume, met with H.E. Nguyen Van Thang, Minis… [+3825 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "David Okoya",
    "title": "Coinbase Institutional Says Several Signs Point To 'Crypto Winter' But Remains Optimistic About H2 2025",
    "description": "Coinbase Institutional has suggested that the cryptocurrency market is at the start of a bearish cycle. Bitcoin and major altcoins have fallen below a key...",
    "url": "https://finance.yahoo.com/news/coinbase-institutional-says-several-signs-140101340.html",
    "urlToImage": "https://media.zenfs.com/en/Benzinga/28361fd4b580edcabe29ddd3f3e9f506",
    "publishedAt": "2025-04-19T14:01:01Z",
    "content": "<ul><li>Coinbase Institutional has suggested that the cryptocurrency market is at the start of a bearish cycle.\r\n</li><li>Bitcoin and major altcoins have fallen below a key technical level.\r\n</li><li… [+4383 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CoinDesk"
    },
    "author": "Nikhilesh De",
    "title": "Unpacking the DOJ's Crypto Enforcement Memo",
    "description": "Legal experts say it may not significantly alter the types of cases the DOJ brings.",
    "url": "https://www.coindesk.com/news-analysis/2025/04/19/unpacking-the-dojs-crypto-enforcement-memo",
    "urlToImage": "https://cdn.sanity.io/images/s3y3vcno/production/94ad4fc9a02d218ba3578fb063b94fe0ae894ad7-6000x4000.jpg?auto=format",
    "publishedAt": "2025-04-19T13:30:00Z",
    "content": "Earlier this month, the Department of Justice disbanded its National Cryptocurrency Enforcement Team and said it would no longer pursue what Deputy Attorney General Todd Blanche described as \"regulat… [+12626 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Zoltan Vardai",
    "title": "Crypto, DeFi may widen wealth gap, destabilize finance: BIS report",
    "description": "The growing adoption of cryptocurrencies may pose risks to the traditional financial system and exacerbate wealth inequality, according to the Bank for International Settlements (BIS).In an April 15 report, the BIS warned that the number of investors and amou…",
    "url": "https://cointelegraph.com/news/crypto-adoption-critical-mass-regulation-wealth-gap-bis",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/01964da3-c3df-7b7d-853a-5110f483c150",
    "publishedAt": "2025-04-19T11:43:58Z",
    "content": "The growing adoption of cryptocurrencies may pose risks to the traditional financial system and exacerbate wealth inequality, according to the Bank for International Settlements (BIS).\r\nIn an April 1… [+2742 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Naturalnews.com"
    },
    "author": "Belle Carter",
    "title": "New York proposes blockchain integration in public payments",
    "description": "Assembly Bill A7788, introduced by Assemblyman Clyde Vanel, would allow New York state agencies to accept Bitcoin, Ether, Litecoin and Bitcoin Cash for taxes, fines, rent and civil penalties, mirroring similar efforts in states like Colorado and Louisiana. Th…",
    "url": "https://www.naturalnews.com/2025-04-19-new-york-proposes-blockchain-integration-public-payments.html",
    "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/04/Ripple-Cryptocurrency-Xrp-Crypto-Blockchain-Finance-3D.jpg",
    "publishedAt": "2025-04-19T06:00:00Z",
    "content": "<ul><li>Assembly Bill A7788, introduced by Assemblyman Clyde Vanel, would allow New York state agencies to accept Bitcoin, Ether, Litecoin and Bitcoin Cash for taxes, fines, rent and civil penalties,… [+6692 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "Crypto Wealth Could Take A Hit As Slovenia Weighs 25% Tax",
    "description": "Slovenia’s Finance Ministry released a draft bill that would tax profits from the sale of cryptocurrencies at 25%, potentially sealing the nation’s status as a tax haven for investors in digital assets. The plan is designed to close a loophole that currently …",
    "url": "https://bitcoinist.com/crypto-wealth-could-take-a-hit-as-slovenia-weighs-25-tax/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/a_f498e5.jpg",
    "publishedAt": "2025-04-19T05:00:03Z",
    "content": "Slovenia’s Finance Ministry released a draft bill that would tax profits from the sale of cryptocurrencies at 25%, potentially sealing the nation’s status as a tax haven for investors in digital asse… [+2936 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Gino Matos",
    "title": "Legal experts recommend flexible approach for SEC to define tokens as securities",
    "description": "The DeFi Education Fund (DEF) submitted a letter to the Securities and Exchange Commission (SEC) on April 18 proposing five core principles for creating a “token safe harbor” framework to support decentralized finance initiatives while broader regulatory legi…",
    "url": "https://cryptoslate.com/legal-experts-recommend-flexible-approach-for-sec-to-define-tokens-as-securities/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/03/sec-foia.jpg",
    "publishedAt": "2025-04-19T00:00:12Z",
    "content": "The DeFi Education Fund (DEF) submitted a letter to the Securities and Exchange Commission (SEC) on April 18 proposing five core principles for creating a token safe harbor framework to support decen… [+4695 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "Crypto Mixer eXch Calls It Quits: Under Fire Over Bybit Hack",
    "description": "Cryptocurrency exchange eXch will close down on May 1 after being accused of facilitating money laundering of funds stolen in the record-breaking Bybit hack. The firm made the announcement yesterday in a statement that cited pressure from law enforcement as t…",
    "url": "https://bitcoinist.com/crypto-mixer-exch-calls-it-quits-under-fire-over-bybit-hack/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/a_bc6a13.jpg",
    "publishedAt": "2025-04-18T23:00:35Z",
    "content": "Cryptocurrency exchange eXch will close down on May 1 after being accused of facilitating money laundering of funds stolen in the record-breaking Bybit hack. The firm made the announcement yesterday … [+3187 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Assad Jafri",
    "title": "Kyrgyzstan moves toward digital currency with new CBDC legislation",
    "description": "Kyrgyzstan has officially authorized the development of a central bank digital currency (CBDC) following the passage of new legislation signed by President Sadyr Zhaparov, granting legal tender status to a future “digital som.” The constitutional law, signed …",
    "url": "https://cryptoslate.com/kyrgyzstan-moves-toward-digital-currency-with-new-cbdc-legislation/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/04/Untitled-design-12.jpg",
    "publishedAt": "2025-04-18T20:30:18Z",
    "content": "Kyrgyzstan has officially authorized the development of a central bank digital currency (CBDC) following the passage of new legislation signed by President Sadyr Zhaparov, granting legal tender statu… [+2734 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "ZyCrypto"
    },
    "author": "Aliyu Pokima",
    "title": "President Trump’s Crypto Advisor Reveals Ways To Bolster Bitcoin Reserves",
    "description": "The head of the Presidential Crypto Advisory Committee, Bo Hines, highlighted ways the United States could improve its Bitcoin (BTC) reserves.",
    "url": "https://zycrypto.com/president-trumps-crypto-advisor-reveals-ways-to-bolster-bitcoin-reserves/",
    "urlToImage": "https://zycrypto.com/wp-content/uploads/2025/02/Trump-Ties-Bitcoins-Surge-to-His-Policies-Promises-U.S.-Crypto-Dominance.jpg",
    "publishedAt": "2025-04-18T19:55:24Z",
    "content": "The head of the Presidential Crypto Advisory Committee, Bo Hines, highlighted ways the United States could improve its Bitcoin (BTC) reserves. This comes on the heels of positive developments around … [+2278 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "The Daily Hodl"
    },
    "author": "Daniell Marlow",
    "title": "Oregon State Attorney General Files ‘Copycat’ Lawsuit Against Coinbase",
    "description": "The state Attorney General of Oregon is suing the top US-based crypto exchange. According to a release from Oregon Attorney General Dan Rayfield, Oregon is leading the charge to fill the void left in crypto regulation enforcement by the Trump administration. …",
    "url": "https://dailyhodl.com/2025/04/18/oregon-state-attorney-general-files-copycat-lawsuit-against-coinbase/",
    "urlToImage": "https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-slapped-fine-dutch.jpg",
    "publishedAt": "2025-04-18T18:41:14Z",
    "content": "The state Attorney General of Oregon is suing the top US-based crypto exchange.\r\nAccording to a release from Oregon Attorney General Dan Rayfield, Oregon is leading the charge to fill the void left i… [+1431 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Turner Wright",
    "title": "US Prosecutors to pursue ex-SafeMoon CEO case despite DOJ memo",
    "description": "Federal prosecutors said they will continue pursuing their case against Braden John Karony, the former CEO of crypto firm SafeMoon, despite the US Justice Department issuing a memo suggesting a policy of abandoning “regulation by prosecution” related to digit…",
    "url": "https://cointelegraph.com/news/safemoon-criminal-case-crypto-enforcement-memo",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2024-11/01932896-f236-73a3-9419-8c86d44b2248",
    "publishedAt": "2025-04-18T18:39:00Z",
    "content": "Federal prosecutors said they will continue pursuing their case against Braden John Karony, the former CEO of crypto firm SafeMoon, despite the US Justice Department issuing a memo suggesting a polic… [+3255 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Decrypt"
    },
    "author": "Mathew Di Salvo",
    "title": "Coinbase Faces 'Copycat' Securities Lawsuit in Oregon After Dodging Gensler's SEC",
    "description": "The crypto exchange giant called the filing “meritless” and said it would do “whatever is required to beat it.”",
    "url": "https://decrypt.co/315364/coinbase-faces-copycat-securities-lawsuit-in-oregon-after-dodging-genslers-sec",
    "urlToImage": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2025/04/Coinbase-App-gID_7.jpg",
    "publishedAt": "2025-04-18T18:34:48Z",
    "content": "Oregon filed a lawsuit against Coinbase on Friday, accusing the crypto exchange giant of violating state securities law by driving and promoting the sale of cryptocurrencies as unregistered securitie… [+2213 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Oluwapelumi Adejumo",
    "title": "Coinbase sounds alarm against potential Oregon ‘copycat’ securities lawsuit",
    "description": "Coinbase is pushing back against a fresh legal challenge from Oregon Attorney General Dan Rayfield, according to an April 18 statement. In a post on social media platform X, Paul Grewal, Coinbase’s chief legal officer, called it a “copycat case” that mimics t…",
    "url": "https://cryptoslate.com/coinbase-sounds-alarm-against-potential-oregon-copycat-securities-lawsuit/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/04/coinbase-enforcement-action.jpg",
    "publishedAt": "2025-04-18T18:00:46Z",
    "content": "Coinbase is pushing back against a fresh legal challenge from Oregon Attorney General Dan Rayfield, according to an April 18 statement.\r\nIn a post on social media platform X, Paul Grewal, Coinbase’s … [+2810 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Vince Quill",
    "title": "Oregon targets Coinbase after SEC drops its federal lawsuit",
    "description": "Oregon Attorney General Dan Rayfield is planning a lawsuit against crypto exchange Coinbase, alleging the company is selling unregistered securities to residents of the US state, after the United States Securities and Exchange Commission's (SEC) dropped its f…",
    "url": "https://cointelegraph.com/news/oregon-attorney-general-resurrects-sec-enforcement-case-against-coinbase",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-01/019460f4-d5f3-7905-9fad-e6ac7d82288e",
    "publishedAt": "2025-04-18T15:56:48Z",
    "content": "Oregon Attorney General Dan Rayfield is planning a lawsuit against crypto exchange Coinbase, alleging the company is selling unregistered securities to residents of the US state, after the United Sta… [+2262 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Axel Schorn and Dr. Duc Au",
    "title": "Standardization is essential to enable crypto adoption",
    "description": "Opinion by: Axel Schorn and Dr. Duc AuTraditional stocks, bonds and commodities markets have long benefited from well-established standards governing the flow of information and data. These standards underpin the seamless functioning of trading, settlement an…",
    "url": "https://cointelegraph.com/news/standardization-is-essential-to-enable-adoption",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-01/0194a717-eac0-7029-8afc-b3f77e2fa5e4",
    "publishedAt": "2025-04-18T15:00:00Z",
    "content": "Opinion by: Axel Schorn and Dr. Duc Au\r\nTraditional stocks, bonds and commodities markets have long benefited from well-established standards governing the flow of information and data. These standar… [+5373 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoSlate"
    },
    "author": "Liam 'Akiba' Wright",
    "title": "Former SEC lawyer warns ending SEC crypto action could trigger bank contagion",
    "description": "A guest essay by former SEC enforcement official John Reed Stark and Duke University lecturer Lee Reiners suggests that the Securities and Exchange Commission’s changing stance on digital assets could recreate conditions that preceded the 2008 financial crisi…",
    "url": "https://cryptoslate.com/former-sec-lawyer-warns-ending-sec-crypto-action-could-trigger-bank-contagion/",
    "urlToImage": "https://cryptoslate.com/wp-content/uploads/2025/04/us-sec.jpg",
    "publishedAt": "2025-04-18T13:53:22Z",
    "content": "A guest essay by former SEC enforcement official John Reed Stark and Duke University lecturer Lee Reiners suggests that the Securities and Exchange Commissions changing stance on digital assets could… [+5738 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Leigh Cuen, Forbes Staff, \n Leigh Cuen, Forbes Staff\n https://www.forbes.com/sites/leighcuen/",
    "title": "How Trump’s Bitcoin Policies Are Making The U.S. A Crypto Superpower",
    "description": "Trump made many campaign promises to ease regulations on crypto businesses. His administration appears to be delivering and setting the stage for a bitcoin bull market.",
    "url": "https://www.forbes.com/sites/digital-assets/2025/04/18/how-trumps-bitcoin-policies-are-making-the-us-a-crypto-superpower/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67fff6b6a9ab70b16871ba77/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-04-18T10:00:00Z",
    "content": "US President Donald Trump, right, and Nayib Bukele, El Salvador's president, are both leading pro-bitcoin economic strategies that set their respective nations apart in the global crypto marketplace.… [+10887 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "Binance Goes Diplomatic: Advising Governments On Crypto Laws",
    "description": "Crypto exchange Binance is remodeling its attitude toward regulation, flipping the script on its former notoriety as a pain in the neck of sorts to a role as an insider policy adviser to governments worldwide. The organization currently advises governments in…",
    "url": "https://bitcoinist.com/binance-goes-diplomatic-advising-governments-on-crypto-laws/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2025/04/a_7538d5.jpg",
    "publishedAt": "2025-04-18T06:00:27Z",
    "content": "Crypto exchange Binance is remodeling its attitude toward regulation, flipping the script on its former notoriety as a pain in the neck of sorts to a role as an insider policy adviser to governments … [+2957 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "The Punch"
    },
    "author": "Oluwakemi Abimbola",
    "title": "Ponzi scams: CBEX crash highlights need for public awareness, investment regulation",
    "description": "They come with different names but their configuration remains the same, and every time Nigerians fall for them, losing millions of naira in the process. In this piece, OLUWAKEMI ABIMBOLA explores Ponzi schemes that promise wealth but deliver tears and heartb…",
    "url": "https://punchng.com/ponzi-scams-cbex-crash-highlights-need-for-public-awareness-investment-regulation/",
    "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2024/04/30212513/Agama-839x630.jpg",
    "publishedAt": "2025-04-18T03:38:33Z",
    "content": "They come with different names but their configuration remains the same, and every time Nigerians fall for them, losing millions of naira in the process. In this piece, OLUWAKEMI ABIMBOLA explores Po… [+11179 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cointelegraph"
    },
    "author": "Cointelegraph by Brayden Lindrea",
    "title": "Kyrgyzstan’s president signs CBDC law giving ‘digital som’ legal status",
    "description": "Kyrgyzstan President Sadyr Zhaparov has signed a constitutional law authorizing the launch of a central bank digital currency pilot project while also giving the “digital som” — the national currency in digital form — legal tender status.The law gives the Nat…",
    "url": "https://cointelegraph.com/news/kyrgyzstan-president-signs-cbdc-law-giving-digital-som-legal-status",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-04/019645b7-9fc1-7e87-929e-18b8e0f20977",
    "publishedAt": "2025-04-18T00:23:53Z",
    "content": "Kyrgyzstan President Sadyr Zhaparov has signed a constitutional law authorizing the launch of a central bank digital currency pilot project while also giving the digital som the national currency in … [+2347 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Ambcrypto.com"
    },
    "author": "Gladys Makena",
    "title": "China seized 15,000 BTC – Here’s why $1.2B remains locked up",
    "description": "Local authorities in China have seized 15k BTC as they sell Cryptocurrencies to support public finances",
    "url": "https://ambcrypto.com/china-seized-15000-btc-heres-why-1-2b-remains-locked-up/",
    "urlToImage": "https://ambcrypto.com/wp-content/uploads/2025/04/Gladys-67-1000x600.jpg",
    "publishedAt": "2025-04-18T00:00:12Z",
    "content": "<ul><li>Chinese local authorities were selling seized cryptocurrencies to finance the local economy.</li><li>China seized 15k BTC as the ban on crypto raises debate over regulations.</li></ul>While c… [+2947 chars]"
  }
]